
## Plan Result (shareable-lists-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/97332)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Update
  * aws_lambda_function.sqs-event-consumer_lambda_477DAF53


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.sqs-event-consumer_lambda_477DAF53 will be updated in-place
  ~ resource "aws_lambda_function" "sqs-event-consumer_lambda_477DAF53" {
        id                             = "ShareableListsApi-Prod-Sqs-Event-Consumer-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:ShareableListsApi-Prod-Sqs-Event-Consumer-Function:171" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:ShareableListsApi-Prod-Sqs-Event-Consumer-Function:171/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
      ~ version                        = "171" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"                 = "arn:aws:ssm:us-east-1:996905175585:parameter/ShareableListsApi/Prod/SERVICE_HASH" -> null
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "app"
                                  + ContainerPort = 4029
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/ShareableListsApi-Prod:434"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + sqs-event-consumer_lambda-code-deploy_lambda_codedeploy_app_96C40F17   = "ShareableListsApi-Prod-Sqs-Event-Consumer-Lambda"
  + sqs-event-consumer_lambda-code-deploy_lambda_codedeploy_group_694E15FB = "ShareableListsApi-Prod-Sqs-Event-Consumer-Lambda"
  + sqs-event-consumer_lambda_lambda_arn_60E7DB68                          = "arn:aws:lambda:us-east-1:996905175585:function:ShareableListsApi-Prod-Sqs-Event-Consumer-Function"
  + sqs-event-consumer_lambda_lambda_function_name_5ED1A66A                = "ShareableListsApi-Prod-Sqs-Event-Consumer-Function"
  + sqs-event-consumer_lambda_lambda_version_arn_79054687                  = "arn:aws:lambda:us-east-1:996905175585:function:ShareableListsApi-Prod-Sqs-Event-Consumer-Function:DEPLOYED"
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"051c55ef-bcbf-429d-88a4-df9cd5f9f95e","JobName":"shareable-lists-api_infrastructure_plan_prod","PRNumber":329,"Program":"tfcmt","SHA1":"63ab645f13cf50a53b56a8235344fc45f0b9c23b","Target":"shareable-lists-api-cdk","Vars":{}} -->